package greek;

public class Greek {
	static final String loremIpsum = "Lorem ipsum dolor sit amet, consetetur sadipscing elitr, sed diam nonumy\n" +
		"eirmod tempor invidunt ut labore et dolore magna aliquyam erat, sed diam\n" +
		"voluptua. At vero eos et accusam et justo duo dolores et ea rebum. Stet\n" +
		"clita kasd gubergren, no sea takimata sanctus est Lorem ipsum dolor sit\n" +
		"amet. Lorem ipsum dolor sit amet, consetetur sadipscing elitr, sed diam\n" +
		"nonumy eirmod tempor invidunt ut labore et dolore magna aliquyam erat,\n" +
		"sed diam voluptua. At vero eos et accusam et justo duo dolores et ea\n" +
		"rebum. Stet clita kasd gubergren, no sea takimata sanctus est Lorem\n" +
		"ipsum dolor sit amet. Lorem ipsum dolor sit amet, consetetur sadipscing\n" +
		"elitr, sed diam nonumy eirmod tempor invidunt ut labore et dolore magna\n" +
		"aliquyam erat, sed diam voluptua. At vero eos et accusam et justo duo\n" +
		"dolores et ea rebum. Stet clita kasd gubergren, no sea takimata sanctus\n" +
		"est Lorem ipsum dolor sit amet.\n" +
		"\n" +
		"Duis autem vel eum iriure dolor in hendrerit in vulputate velit esse\n" +
		"molestie consequat, vel illum dolore eu feugiat nulla facilisis at vero\n" +
		"eros et accumsan et iusto odio dignissim qui blandit praesent luptatum\n" +
		"zzril delenit augue duis dolore te feugait nulla facilisi. Lorem ipsum\n" +
		"dolor sit amet, consectetuer adipiscing elit, sed diam nonummy nibh\n" +
		"euismod tincidunt ut laoreet dolore magna aliquam erat volutpat.\n" +
		"\n" +
		"Ut wisi enim ad minim veniam, quis nostrud exerci tation ullamcorper\n" +
		"suscipit lobortis nisl ut aliquip ex ea commodo consequat. Duis autem\n" +
		"vel eum iriure dolor in hendrerit in vulputate velit esse molestie\n" +
		"consequat, vel illum dolore eu feugiat nulla facilisis at vero eros et\n" +
		"accumsan et iusto odio dignissim qui blandit praesent luptatum zzril\n" +
		"delenit augue duis dolore te feugait nulla facilisi.\n";

	static final String aristotleCV = "Αριστοτέλης\n" +
		"\n" +
		"Από τη Βικιπαίδεια, την ελεύθερη εγκυκλοπαίδεια\n" +
		"\n" +
		"Ο Αριστοτέλης (αρχ.  ?ριστοτέλης 384 - 322 π.Χ.) ήταν αρχαίος Έλληνας \n" +
		"φιλόσοφος και πολυεπιστήμονας, μαθητής του Πλάτωνα και διδάσκαλος του \n" +
		"Μεγάλου Αλεξάνδρου. Μαζί με το δάσκαλό του Πλάτωνα αποτελεί σημαντική μορφή \n" +
		"της φιλοσοφικής σκέψης του αρχαίου κόσμου, και η διδασκαλία του διαπερνούσε \n" +
		"βαθύτατα τη δυτική φιλοσοφική και επιστημονική σκέψη μέχρι και την \n" +
		"Επιστημονική Επανάσταση του 17ου αιώνα. Υπήρξε φυσιοδίφης, φιλόσοφος, \n" +
		"δημιουργός της λογικής και ο σημαντικότερος από τους διαλεκτικούς της \n" +
		"αρχαιότητας.\n" +
		"\n" +
		"Ζωή και δράση\n" +
		"\n" +
		"Ο Αριστοτέλης γεννήθηκε μεταξύ Ιουλίου και Δεκεμβρίου του έτους 384 π.Χ. στα \n" +
		"Αρχαία Στάγειρα της Χαλκιδικής (σημερινή ονομασία της περιοχής Λιοτόπι, \n" +
		"μισό \n" +
		"χιλιόμετρο νοτίως της Ολυμπιάδας). Ο πατέρας του Νικόμαχος ήταν γιατρός του \n" +
		"βασιλιά της Μακεδονίας Αμύντα Γ΄, τον οποίο είχε πατέρα ο Φίλιππος. Ο \n" +
		"Νικόμαχος, που κατά το Σουίδα είχε γράψει έξι βιβλία ιατρικής και ένα \n" +
		"φυσικής, θεωρούσε πρόγονό του τον ομηρικό ήρωα και γιατρό Μαχάονα, το γιο \n" +
		"του Ασκληπιού. Πίστευαν ότι και της μητέρας του η καταγωγή ήταν θεϊκή. \n" +
		"Ονομαζόταν Φαιστίς, είχε έρθει με Χαλκιδείς αποίκους στα Στάγειρα και ανήκε \n" +
		"στο γένος των Ασκληπιαδών.\n" +
		"\n" +
		"Ο Αριστοτέλης πρόωρα ορφάνεψε από πατέρα και μητέρα και την κηδεμονία του \n" +
		"ανέλαβε ο φίλος του πατέρα του Πρόξενος, που ήταν εγκαταστημένος στον \n" +
		"Αταρνέα της μικρασιατικής Αιολίδας, απέναντι από τη Λέσβο. Ο Πρόξενος, που \n" +
		"φρόντισε τον Αριστοτέλη σαν δικό του παιδί, τον έστειλε στην Αθήνα σε \n" +
		"ηλικία \n" +
		"17 ετών (367 π.Χ.), για να γίνει μαθητής του Πλάτωνα. Πράγματι ο \n" +
		"Αριστοτέλης \n" +
		"σπούδασε στην Ακαδημία του Πλάτωνα επί 20 χρόνια (367 - 347), μέχρι τη \n" +
		"χρονιά δηλ. που πέθανε ο δάσκαλός του. Στο περιβάλλον της Ακαδημίας άφηνε \n" +
		"κατάπληκτους όλους και τον ίδιο το δάσκαλό του, με την ευφυΐα και τη \n" +
		"φιλοπονία του. Ο Πλάτωνας τον ονόμαζε \"νουν της διατριβής\" και το σπίτι του \n" +
		"\"οίκον αναγνώστου\".\n" +
		"\n" +
		"\n" +
		"Όταν το 347 π.Χ. πέθανε ο Πλάτωνας, προέκυψε θέμα διαδόχου στη διεύθυνση της \n" +
		"σχολής. Επικρατέστεροι για το αξίωμα ήταν οι τρεις καλύτεροι μαθητές του \n" +
		"Πλάτωνα, ο Αριστοτέλης, ο Ξενοκράτης και ο Σπεύσιππος. Ο Αριστοτέλης τότε \n" +
		"μαζί με τον Ξενοκράτη εγκατέλειψε την Αθήνα και εγκαταστάθηκαν στην Άσσο, \n" +
		"πόλη της μικρασιατικής παραλίας, απέναντι από τη Λέσβο. Την Άσσο \n" +
		"κυβερνούσαν \n" +
		"τότε δύο πλατωνικοί φιλόσοφοι, ο Έραστος και ο Κορίσκος, στους οποίους είχε \n" +
		"χαρίσει την πόλη ο ηγεμόνας του Αταρνέα και παλιός μαθητής του Πλάτωνα και \n" +
		"του Αριστοτέλη, Ερμίας. Οι δύο φίλοι, κυβερνήτες της Άσσο, είχαν ιδρύσει \n" +
		"εκεί μια φιλοσοφική σχολή, ως παράρτημα της Ακαδημίας.\n" +
		"\n" +
		"Στην Άσσο ο Αριστοτέλης δίδαξε τρία χρόνια και μαζί με τους φίλους του \n" +
		"κατόρθωσε ό,τι δεν μπόρεσε ο Πλάτωνας. Συνδέθηκαν στενά με τον Ερμία και \n" +
		"τον \n" +
		"επηρέασαν τόσο, ώστε η τυραννία του να καταστεί ηπιότερη και δικαιότερη. Το \n" +
		"τέλος του τυράννου όμως ήταν τραγικό. Επειδή προέβλεπε την εκστρατεία των \n" +
		"Μακεδόνων στην Ασία, συμμάχησε με το Φίλιππο. Γι' αυτό τον συνέλαβαν οι \n" +
		"Πέρσες και τον θανάτωσαν με μαρτυρικό σταυρικό θάνατο.\n" +
		"\n" +
		"Το 345 π.Χ. ο Αριστοτέλης, ακολουθώντας τη συμβουλή του μαθητή του \n" +
		"Θεόφραστου, πέρασε απέναντι στη Λέσβο και εγκαταστάθηκε στη Μυτιλήνη, όπου \n" +
		"έμεινε και δίδαξε μέχρι το 342 π.Χ. Στο μεταξύ είχε παντρευτεί την ανιψιά \n" +
		"και θετή κόρη του Ερμία, την Πυθιάδα, από την οποία απέκτησε κόρη, που πήρε \n" +
		"το όνομα της μητέρας της. Μετά το θάνατο της πρώτης του συζύγου ο \n" +
		"Αριστοτέλης συνδέθηκε αργότερα στην Αθήνα με τη Σταγειρίτισσα Ερπυλλίδα, \n" +
		"από \n" +
		"την οποία απέκτησε ένα γιο, το Νικόμαχο. Το 342 π.Χ. τον προσκάλεσε ο \n" +
		"Φίλιππος στη Μακεδονία, για να αναλάβει τη διαπαιδαγώγηση του γιου του \n" +
		"Αλέξανδρου, που ήταν τότε μόλις 13 χρονών. Ο Αριστοτέλης άρχισε με προθυμία \n" +
		"το έργο της αγωγής του νεαρού διαδόχου. Φρόντισε να του μεταδώσει το \n" +
		"πανελλήνιο πνεύμα και χρησιμοποίησε ως παιδευτικό όργανο τα ομηρικά έπη. Η \n" +
		"εκπαίδευση του Αλέξανδρου γινόταν άλλοτε στην Πέλλα και άλλοτε στη Μίεζα, \n" +
		"μια κωμόπολη της οποίας τα ερείπια έφερε στο φως η αρχαιολογική σκαπάνη· \n" +
		"βρισκόταν στους πρόποδες του βουνού πάνω στο οποίο είναι χτισμένη η \n" +
		"σημερινή \n" +
		"Νάουσα της Μακεδονίας. Εκεί το 341 π.Χ. πληροφορήθηκε το θάνατο του Ερμία.\n" +
		"\n" +
		"Ο Αριστοτέλης έμεινε στη μακεδονική αυλή έξι χρόνια. Όταν ο Αλέξανδρος \n" +
		"συνέτριψε την αντίσταση των Θηβαίων και αποκατέστησε την ησυχία στη νότια \n" +
		"Ελλάδα, ο Αριστοτέλης πήγε στην Αθήνα (335 π.Χ.) και ίδρυσε δική του \n" +
		"φιλοσοφική σχολή. Για να εγκαταστήσει τη σχολή του διάλεξε το Γυμνάσιο, που \n" +
		"λεγόταν και Λύκειο, ανάμεσα στο Λυκαβηττό και τον Ιλισό, κοντά στην πύλη \n" +
		"του \n" +
		"Διοχάρη. Ο χώρος του Γυμνασίου βρέθηκε πρόσφατα στις ανασκαφές,για την \n" +
		"ανέγερση του νέου Μουσείου Γουλανδρή,πίσω από το Βυζαντινό Μουσείο Αθηνών, \n" +
		"στην οδό Ρηγίλλης. Ο ιστορικός αυτός αρχαιολογικός χώρος διασκευάζεται έτσι \n" +
		"ώστε να γίνει επισκέψιμος. Εκεί υπήρχε άλσος αφιερωμένο στον Απόλλωνα και \n" +
		"τις Μούσες. Με χρήματα που του έδωσε άφθονα ο Αλέξανδρος, ο Αριστοτέλης \n" +
		"έχτισε μεγαλόπρεπα οικήματα και στοές, που ονομάζονταν \"περίπατοι\". Ίσως \n" +
		"γι' \n" +
		"αυτό η σχολή του ονομάστηκε Περιπατητική και οι μαθητές του περιπατητικοί \n" +
		"φιλόσοφοι.\n" +
		"\n" +
		"Η οργάνωση της σχολής είχε γίνει κατά τα πρότυπα της Πλατωνικής Ακαδημίας. \n" +
		"Τα μαθήματα για τους προχωρημένους μαθητές γίνονταν το πρωί (\"εωθινός \n" +
		"περίπατος\") και για τους αρχάριους το απόγευμα (\"περί το δειλινόν\", \n" +
		"\"δειλινός περίπατος\"). Η πρωινή διδασκαλία ήταν καθαρά φιλοσοφική \n" +
		"(\"ακροαματική\"). Η απογευματινή \"ρητορική\" και \"εξωτερική\".\n" +
		"\n" +
		"Η σχολή είχε μεγάλη βιβλιοθήκη και τόσο καλά οργανωμένη, ώστε αργότερα \n" +
		"χρησίμευσε ως πρότυπο για την ίδρυση των βιβλιοθηκών της Αλεξάνδρειας και \n" +
		"της Περγάμου. Ο Αριστοτέλης μάζεψε χάρτες και όργανα χρήσιμα για τη \n" +
		"διδασκαλία των φυσικών μαθημάτων. Έτσι σύντομα η σχολή έγινε περίφημο \n" +
		"κέντρο \n" +
		"επιστημονικής έρευνας. Στα δεκατρία χρόνια που έμεινε ο Αριστοτέλης στην \n" +
		"Αθήνα δημιούργησε το μεγαλύτερο μέρος του έργου του, που προκαλεί το \n" +
		"θαυμασμό μας με τον όγκο και την ποιοτική του αξία. Γιατί είναι άξιο \n" +
		"απορίας, πώς ένας άνθρωπος σε τόσο λίγο χρονικό διάστημα συγκέντρωσε και \n" +
		"κατέγραψε τόσες πολλές πληροφορίες.\n" +
		"\n" +
		"Το 323 π.Χ. με την είδηση του θανάτου του Μ. Αλεξάνδρου οι οπαδοί του \n" +
		"αντιμακεδονικού κόμματος νόμισαν ότι βρήκαν την ευκαιρία να εκδικηθούν τους \n" +
		"Μακεδόνες στο πρόσωπο του Αριστοτέλη. Το ιερατείο, με εκπρόσωπό του τον \n" +
		"ιεροφάντη της Ελευσίνιας Δήμητρας Ευρυμέδοντα, και η σχολή του Ισοκράτη, με \n" +
		"το Δημόφιλο, κατηγόρησαν τον Αριστοτέλη για ασέβεια (\"γραφή ασεβείας\"), \n" +
		"επειδή είχε ιδρύσει βωμό στον Ερμία, είχε γράψει τον ύμνο στην Αρετή και το \n" +
		"επίγραμμα στον ανδριάντα του Ερμία, στους Δελφούς. Ο Αριστοτέλης όμως, \n" +
		"επειδή κατάλαβε τα πραγματικά κίνητρα και τις αληθινές προθέσεις των \n" +
		"μηνυτών \n" +
		"του, έφυγε για τη Χαλκίδα, προτού γίνει η δίκη του (323 π.Χ.). Εκεί έμεινε, \n" +
		"στο σπίτι που είχε από τη μητέρα του, μαζί με τη δεύτερη σύζυγό του την \n" +
		"Ερπυλλίδα και με τα δύο του παιδιά, το Νικόμαχο και την Πυθιάδα.\n" +
		"\n" +
		"Ο Αριστοτέλης απεβίωσε μεταξύ πρώτης και εικοστής δευτέρας Οκτωβρίου του \n" +
		"έτους 322 π.Χ. στη Χαλκίδα από στομαχικό νόσημα, μέσα σε θλίψη και \n" +
		"μελαγχολία. Το σώμα του μεταφέρθηκε στα Στάγειρα, όπου θάφτηκε με \n" +
		"εξαιρετικές τιμές. Οι συμπολίτες του τον ανακήρυξαν \"οικιστή\" της πόλης και \n" +
		"έχτισαν βωμό πάνω στον τάφο του. Στη μνήμη του καθιέρωσαν γιορτή, τα \n" +
		"\"Αριστοτέλεια\", και ονόμασαν έναν από τους μήνες \"Αριστοτέλειο\". Η πλατεία \n" +
		"όπου θάφτηκε ορίστηκε ως τόπος των συνεδρίων της βουλής.\n" +
		"\n" +
		"Φεύγοντας από την Αθήνα, διευθυντή της σχολής άφησε το μαθητή του Θεόφραστο, \n" +
		"που τον έκρινε ως τον πιο κατάλληλο. Έτσι το πνευματικό ίδρυμα του \n" +
		"Αριστοτέλη εξακολούθησε να ακτινοβολεί και μετά το θάνατο του μεγάλου \n" +
		"δασκάλου.";
}
